def replace_date_delete_all_invalid_chars(date_text):
    # функция для того, ЧТОБЫ УБРАТЬ НАХУЙ ВСЕ ПРОБЕЛЫ ПОТОМУ ЧТО НАХУЙ Я УСТАЛА БЛЯТЬ ИХ УБИРАТЬ
    # ВРУЧНУЮ, ИДИТЕ НАХУЙ ПОНЯТНО ИЗВЕСТНО УЗНАЛИ ЧТО ЛИ, ЕБАТЬ КОЛОТИТЬ, КАК ТОЛЬКО СЕРЕДИНА МЕСЯЦА,
    # ТАК БЛЯТЬ ТЫСЯЧА И ЕЩЁ 1 ПРОБЕЛ НАХКЙ, ФАЙЛ НЕ НАЙДЕН, ФАЙЛ НЕ НАЙДЕН, ЁБАНА РОТ ЭТОГО КАЗИНО, Я УСТАЛА ЛЯТЬ

    # код
    # принимаем дату текст, убираем все лишние знаки, это для всего да

    # import re

    clean_date = date_text.replace(" ", "")
    return clean_date
